{"Title":{"0":"NASA Perseverance Mars Rover Scientists Train in the Nevada Desert","1":"A Year of Surprising Science From NASA's InSight Mars Mission","2":"Three New Views of Mars' Moon Phobos","3":"NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight","4":"NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound","5":"NASA's Treasure Map for Water Ice on Mars","6":"From JPL's Mailroom to Mars and Beyond","7":"NASA's Mars Perseverance Rover Gets Its Sample Handling System","8":"NASA's Briefcase-Size MarCO Satellite Picks Up Honors","9":"NASA to Reveal Name of Its Next Mars Rover","10":"NASA to Hold Mars 2020 Perseverance Rover Launch Briefing","11":"Mars 2020 Unwrapped and Ready for More Testing","12":"NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch","13":"Mars Is Getting a New Robotic Meteorologist","14":"NASA's Mars Reconnaissance Orbiter Undergoes Memory Update"},"Preview":{"0":"Team members searched for signs of ancient microscopic life there, just as NASA's latest rover will on the Red Planet next year.","1":"A batch of new papers summarizes the lander's findings above and below the surface of the Red Planet.","2":"Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow.","3":"Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check.","4":"The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet.","5":"A new study identifies frozen water just below the Martian surface, where astronauts could easily dig it up.","6":"Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center.","7":"The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period.","8":"The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology.","9":"After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. ","10":"Learn more about the agency's next Red Planet mission during a live event on June 17.","11":"In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing.","12":"The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July.","13":"Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles.","14":"Other orbiters will continue relaying data from Mars surface missions for a two-week period."}}